//
//  TestData.swift
//  TrueLoveProject
//
//  Created by Bomi on 2020/5/17.
//  Copyright © 2020 PrototypeC. All rights reserved.
//

import Foundation

let testData: Array<[String : Any]> =
    [
    [
    "type": "FeatureCollection",
    "features":
        ["type": "Feature",
         "properties":
            [
            "id": "5945050176",
            "name": "永和藥局",
            "phone": "03-8573247",
            "address": "花蓮縣吉安鄉北昌村建國路１段１４５號",
            "mask_adult": 1494,
            "mask_child": 556,
            "updated": "2020/05/17 16:59:33",
            "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午休診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午休診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
            "note": "口罩販售時間：星期一到六早上9:00開始，賣完為止 4/13 4/14無兒童口罩",
            "custom_note": "",
            "website": "",
            "county": "花蓮縣",
            "town": "吉安鄉",
            "cunli": "北昌村",
            "service_periods": "NNNNNNYNNNNNNYNNNNNNN"
            ],
          "geometry":
            [
            "type": "Point",
            "coordinates": [121.59094,23.985948]
            ]
    ]
        ],
    [
            "type": "Feature",
            "properties": [
            "id": "5945010154",
            "name": "郭藥局",
            "phone": "03-8230761",
            "address": "花蓮縣花蓮市中美路９５號之３",
            "mask_adult": 3649,
            "mask_child": 1097,
            "updated": "2020/05/17 16:59:33",
            "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午休診、星期日上午休診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午看診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
            "note": "服務時段：上午10-12、下午2:30-4:30、晚上7-8:30",
            "custom_note": "",
            "website": "",
            "county": "花蓮縣",
            "town": "花蓮市",
            "cunli": "民勤里",
            "service_periods": "NNNNNYYNNNNNNNNNNNNNN"],
        
            "geometry": [
            "type": "Point",
            "coordinates": [
            121.624669,
            23.990268
            ]
            ]
            ],


]
//
//    "type": "Feature",
//    "properties": {
//    "id": "5945050176",
//    "name": "永和藥局",
//    "phone": "03-8573247",
//    "address": "花蓮縣吉安鄉北昌村建國路１段１４５號",
//    "mask_adult": 1494,
//    "mask_child": 556,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午休診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午休診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
//    "note": "口罩販售時間：星期一到六早上9:00開始，賣完為止 4\/13 4\/14無兒童口罩",
//    "custom_note": "",
//    "website": "",
//    "county": "花蓮縣",
//    "town": "吉安鄉",
//    "cunli": "北昌村",
//    "service_periods": "NNNNNNYNNNNNNYNNNNNNN"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    121.59094,
//    23.985948
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5945010154",
//    "name": "郭藥局",
//    "phone": "03-8230761",
//    "address": "花蓮縣花蓮市中美路９５號之３",
//    "mask_adult": 3649,
//    "mask_child": 1097,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午休診、星期日上午休診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午看診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
//    "note": "服務時段：上午10-12、下午2:30-4:30、晚上7-8:30",
//    "custom_note": "",
//    "website": "",
//    "county": "花蓮縣",
//    "town": "花蓮市",
//    "cunli": "民勤里",
//    "service_periods": "NNNNNYYNNNNNNNNNNNNNN"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    121.624669,
//    23.990268
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5945010289",
//    "name": "易生藥局",
//    "phone": "03-8322927",
//    "address": "花蓮縣花蓮市中正路４４３號",
//    "mask_adult": 3249,
//    "mask_child": 450,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午看診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午休診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上休診",
//    "note": "08：00-22：00，口罩販售同營業時間。星期日08:00-12:00",
//    "custom_note": "",
//    "website": "",
//    "county": "花蓮縣",
//    "town": "花蓮市",
//    "cunli": "主信里",
//    "service_periods": "NNNNNNNNNNNNNYNNNNNNY"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    121.604473,
//    23.975465
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5943010665",
//    "name": "中美藥局",
//    "phone": "08-7348697",
//    "address": "屏東縣屏東市扶風里林森路４５號",
//    "mask_adult": 2898,
//    "mask_child": 800,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午休診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午休診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上休診",
//    "note": "自2\/11日~2\/29日，營業日08:30~22:00為販賣口罩時間，售完為止",
//    "custom_note": "",
//    "website": "",
//    "county": "屏東縣",
//    "town": "屏東市",
//    "cunli": "扶風里",
//    "service_periods": "NNNNNNYNNNNNNYNNNNNNY"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    120.4936673,
//    22.6724044
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5942240043",
//    "name": "光輝藥局",
//    "phone": "07-6671106",
//    "address": "高雄市內門區鄉觀亭里南屏路２３０號",
//    "mask_adult": 4338,
//    "mask_child": 1156,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午看診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午看診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
//    "note": "自3\/01日~3\/31日，營業日8:30起為販賣口罩時間，售完為止",
//    "custom_note": "",
//    "website": "",
//    "county": "高雄市",
//    "town": "內門區",
//    "cunli": "觀亭里",
//    "service_periods": "NNNNNNNNNNNNNNNNNNNNN"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    120.454734,
//    22.923054
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5943010156",
//    "name": "新東洋藥局",
//    "phone": "08-7323388",
//    "address": "屏東縣屏東市民生路２３８號",
//    "mask_adult": 0,
//    "mask_child": 0,
//    "updated": "2020\/05\/17 17:02:03",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午看診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午休診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
//    "note": "營業日上午9:30至 晚上21:30為販賣口罩時間，售完為止",
//    "custom_note": "",
//    "website": "",
//    "county": "屏東縣",
//    "town": "屏東市",
//    "cunli": "楠樹里",
//    "service_periods": "NNNNNNNNNNNNNYNNNNNNN"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    120.492427,
//    22.670135
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5942200030",
//    "name": "順成藥局",
//    "phone": "07-6172407",
//    "address": "高雄市梓官區梓官路城隍巷３１號",
//    "mask_adult": 2079,
//    "mask_child": 10,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午看診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午看診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
//    "note": "口罩販賣時間為早上9:00至售完為止。",
//    "custom_note": "",
//    "website": "",
//    "county": "高雄市",
//    "town": "梓官區",
//    "cunli": "梓和里",
//    "service_periods": "NNNNNNNNNNNNNNNNNNNNN"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    120.268095,
//    22.759289
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5942220032",
//    "name": "文殊堂藥局",
//    "phone": "07-6752176",
//    "address": "高雄市甲仙區西安里文化路２２號",
//    "mask_adult": 2394,
//    "mask_child": 507,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午看診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午看診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
//    "note": "自2\/11日~2\/29日，營業日07:30起為販賣口罩時間，售完為止。",
//    "custom_note": "",
//    "website": "",
//    "county": "高雄市",
//    "town": "甲仙區",
//    "cunli": "西安里",
//    "service_periods": "NNNNNNNNNNNNNNNNNNNNN"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    120.589408,
//    23.081938
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5943190088",
//    "name": "壽泰健康藥局",
//    "phone": "08-8752366",
//    "address": "屏東縣林邊鄉仁和村中山路１９１號",
//    "mask_adult": 1581,
//    "mask_child": 1130,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午看診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午看診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
//    "note": "自2\/11日~2\/29日，營業日實名制口罩發售時間每日7：40.售完為止",
//    "custom_note": "",
//    "website": "",
//    "county": "屏東縣",
//    "town": "林邊鄉",
//    "cunli": "仁和村",
//    "service_periods": "NNNNNNNNNNNNNNNNNNNNN"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    120.516359,
//    22.433278
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5944010089",
//    "name": "宏安藥局",
//    "phone": "06-9273048",
//    "address": "澎湖縣馬公市中華路５４號",
//    "mask_adult": 598,
//    "mask_child": 903,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午看診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午看診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
//    "note": "配合口罩實名制販售時間為08:00開始發放號碼牌，售完為止。",
//    "custom_note": "",
//    "website": "",
//    "county": "澎湖縣",
//    "town": "馬公市",
//    "cunli": "光復里",
//    "service_periods": "NNNNNNNNNNNNNNNNNNNNN"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    119.570783,
//    23.569737
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5943110035",
//    "name": "永效藥局",
//    "phone": "08-7960295",
//    "address": "屏東縣高樹鄉司馬村長美路８３號",
//    "mask_adult": 3136,
//    "mask_child": 955,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午看診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午看診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上休診、星期日晚上休診",
//    "note": "口罩販賣時間早上7點開始售完為止。營業時間7點-19點.",
//    "custom_note": "",
//    "website": "",
//    "county": "屏東縣",
//    "town": "高樹鄉",
//    "cunli": "司馬村",
//    "service_periods": "NNNNNNNNNNNNNNNNNNNYY"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    120.609782,
//    22.848772
//    ]
//    }
//    },
//    {
//    "type": "Feature",
//    "properties": {
//    "id": "5943120022",
//    "name": "何藥局",
//    "phone": "08-7836888",
//    "address": "屏東縣萬巒鄉佳佐村民生路１２９號",
//    "mask_adult": 1242,
//    "mask_child": 980,
//    "updated": "2020\/05\/17 16:59:33",
//    "available": "星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看診、星期日上午看診、星期一下午看診、星期二下午看診、星期三下午看診、星期四下午看診、星期五下午看診、星期六下午看診、星期日下午看診、星期一晚上看診、星期二晚上看診、星期三晚上看診、星期四晚上看診、星期五晚上看診、星期六晚上看診、星期日晚上看診",
//    "note": "自4\/7日起，週一至週六07:30至22:00為販賣口罩時間，週日照常販售，售完為止。",
//    "custom_note": "",
//    "website": "",
//    "county": "屏東縣",
//    "town": "萬巒鄉",
//    "cunli": "佳佐村",
//    "service_periods": "NNNNNNNNNNNNNNNNNNNNN"
//    },
//    "geometry": {
//    "type": "Point",
//    "coordinates": [
//    120.59879,
//    22.570192
//    ]
//    }
//    },
//]
